ycsb_logs_hugepage/run.log
/usr/bin/java  -classpath /root/asterinas/YCSB/conf:/root/asterinas/YCSB/core/target/core-0.18.0-SNAPSHOT.jar:/root/asterinas/YCSB/core/target/dependency/HdrHistogram-2.1.12.jar:/root/asterinas/YCSB/core/target/dependency/htrace-core4-4.1.0-incubating.jar:/root/asterinas/YCSB/core/target/dependency/jackson-core-asl-1.9.4.jar:/root/asterinas/YCSB/core/target/dependency/jackson-mapper-asl-1.9.4.jar:/root/asterinas/YCSB/redis/target/redis-binding-0.18.0-SNAPSHOT.jar:/root/asterinas/YCSB/redis/target/dependency/commons-pool2-2.4.2.jar:/root/asterinas/YCSB/redis/target/dependency/jedis-2.9.0.jar site.ycsb.Client -t -db site.ycsb.db.RedisClient -P ./ycsb-0.17.0/workloads/workload-custom -p redis.host=10.0.2.15
[OVERALL], RunTime(ms), 3422
[OVERALL], Throughput(ops/sec), 29222.676797194625
[TOTAL_GCS_G1_Young_Generation], Count, 0
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.0
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 0
[TOTAL_GC_TIME], Time(ms), 0
[TOTAL_GC_TIME_%], Time(%), 0.0
[READ], Operations, 71
[READ], AverageLatency(us), 95.56338028169014
[READ], MinLatency(us), 33
[READ], MaxLatency(us), 3375
[READ], 95thPercentileLatency(us), 69
[READ], 99thPercentileLatency(us), 3375
[READ], Return=OK, 71
[READ], Return=ERROR, 4810
[DELETE], Operations, 3000
[DELETE], AverageLatency(us), 35.026
[DELETE], MinLatency(us), 14
[DELETE], MaxLatency(us), 2747
[DELETE], 95thPercentileLatency(us), 47
[DELETE], 99thPercentileLatency(us), 60
[DELETE], Return=OK, 3000
[DELETE], Return=ERROR, 92119
[DELETE-FAILED], Operations, 92119
[DELETE-FAILED], AverageLatency(us), 33.655120007815974
[DELETE-FAILED], MinLatency(us), 26
[DELETE-FAILED], MaxLatency(us), 815
[DELETE-FAILED], 95thPercentileLatency(us), 43
[DELETE-FAILED], 99thPercentileLatency(us), 49
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 362.0
[CLEANUP], MinLatency(us), 362
[CLEANUP], MaxLatency(us), 362
[CLEANUP], 95thPercentileLatency(us), 362
[CLEANUP], 99thPercentileLatency(us), 362
[READ-FAILED], Operations, 4810
[READ-FAILED], AverageLatency(us), 17.21039501039501
[READ-FAILED], MinLatency(us), 13
[READ-FAILED], MaxLatency(us), 261
[READ-FAILED], 95thPercentileLatency(us), 25
[READ-FAILED], 99thPercentileLatency(us), 31
/usr/bin/java  -classpath /root/asterinas/YCSB/conf:/root/asterinas/YCSB/core/target/core-0.18.0-SNAPSHOT.jar:/root/asterinas/YCSB/core/target/dependency/HdrHistogram-2.1.12.jar:/root/asterinas/YCSB/core/target/dependency/htrace-core4-4.1.0-incubating.jar:/root/asterinas/YCSB/core/target/dependency/jackson-core-asl-1.9.4.jar:/root/asterinas/YCSB/core/target/dependency/jackson-mapper-asl-1.9.4.jar:/root/asterinas/YCSB/redis/target/redis-binding-0.18.0-SNAPSHOT.jar:/root/asterinas/YCSB/redis/target/dependency/commons-pool2-2.4.2.jar:/root/asterinas/YCSB/redis/target/dependency/jedis-2.9.0.jar site.ycsb.Client -t -db site.ycsb.db.RedisClient -P ./ycsb-0.17.0/workloads/workload-custom -p redis.host=10.0.2.15
[OVERALL], RunTime(ms), 3052
[OVERALL], Throughput(ops/sec), 32765.399737876804
[TOTAL_GCS_G1_Young_Generation], Count, 0
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.0
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 0
[TOTAL_GC_TIME], Time(ms), 0
[TOTAL_GC_TIME_%], Time(%), 0.0
[READ], Operations, 83
[READ], AverageLatency(us), 40.24096385542169
[READ], MinLatency(us), 19
[READ], MaxLatency(us), 267
[READ], 95thPercentileLatency(us), 68
[READ], 99thPercentileLatency(us), 267
[READ], Return=OK, 83
[READ], Return=ERROR, 4925
[DELETE], Operations, 2872
[DELETE], AverageLatency(us), 25.963440111420613
[DELETE], MinLatency(us), 14
[DELETE], MaxLatency(us), 3249
[DELETE], 95thPercentileLatency(us), 44
[DELETE], 99thPercentileLatency(us), 51
[DELETE], Return=OK, 2872
[DELETE], Return=ERROR, 92120
[DELETE-FAILED], Operations, 92120
[DELETE-FAILED], AverageLatency(us), 30.338742943986105
[DELETE-FAILED], MinLatency(us), 26
[DELETE-FAILED], MaxLatency(us), 736
[DELETE-FAILED], 95thPercentileLatency(us), 41
[DELETE-FAILED], 99thPercentileLatency(us), 44
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 566.0
[CLEANUP], MinLatency(us), 566
[CLEANUP], MaxLatency(us), 566
[CLEANUP], 95thPercentileLatency(us), 566
[CLEANUP], 99thPercentileLatency(us), 566
[READ-FAILED], Operations, 4925
[READ-FAILED], AverageLatency(us), 15.558984771573604
[READ-FAILED], MinLatency(us), 13
[READ-FAILED], MaxLatency(us), 1382
[READ-FAILED], 95thPercentileLatency(us), 21
[READ-FAILED], 99thPercentileLatency(us), 24
/usr/bin/java  -classpath /root/asterinas/YCSB/conf:/root/asterinas/YCSB/core/target/core-0.18.0-SNAPSHOT.jar:/root/asterinas/YCSB/core/target/dependency/HdrHistogram-2.1.12.jar:/root/asterinas/YCSB/core/target/dependency/htrace-core4-4.1.0-incubating.jar:/root/asterinas/YCSB/core/target/dependency/jackson-core-asl-1.9.4.jar:/root/asterinas/YCSB/core/target/dependency/jackson-mapper-asl-1.9.4.jar:/root/asterinas/YCSB/redis/target/redis-binding-0.18.0-SNAPSHOT.jar:/root/asterinas/YCSB/redis/target/dependency/commons-pool2-2.4.2.jar:/root/asterinas/YCSB/redis/target/dependency/jedis-2.9.0.jar site.ycsb.Client -t -db site.ycsb.db.RedisClient -P ./ycsb-0.17.0/workloads/workload-custom -p redis.host=10.0.2.15
[OVERALL], RunTime(ms), 3527
[OVERALL], Throughput(ops/sec), 28352.707683583783
[TOTAL_GCS_G1_Young_Generation], Count, 0
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.0
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 0
[TOTAL_GC_TIME], Time(ms), 0
[TOTAL_GC_TIME_%], Time(%), 0.0
[READ], Operations, 61
[READ], AverageLatency(us), 86.67213114754098
[READ], MinLatency(us), 19
[READ], MaxLatency(us), 2593
[READ], 95thPercentileLatency(us), 68
[READ], 99thPercentileLatency(us), 2593
[READ], Return=OK, 61
[READ], Return=ERROR, 4769
[DELETE], Operations, 2744
[DELETE], AverageLatency(us), 33.11698250728863
[DELETE], MinLatency(us), 13
[DELETE], MaxLatency(us), 2579
[DELETE], 95thPercentileLatency(us), 48
[DELETE], 99thPercentileLatency(us), 61
[DELETE], Return=OK, 2744
[DELETE], Return=ERROR, 92426
[DELETE-FAILED], Operations, 92426
[DELETE-FAILED], AverageLatency(us), 34.74794971112025
[DELETE-FAILED], MinLatency(us), 26
[DELETE-FAILED], MaxLatency(us), 1093
[DELETE-FAILED], 95thPercentileLatency(us), 44
[DELETE-FAILED], 99thPercentileLatency(us), 49
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 358.0
[CLEANUP], MinLatency(us), 358
[CLEANUP], MaxLatency(us), 358
[CLEANUP], 95thPercentileLatency(us), 358
[CLEANUP], 99thPercentileLatency(us), 358
[READ-FAILED], Operations, 4769
[READ-FAILED], AverageLatency(us), 18.035437198574126
[READ-FAILED], MinLatency(us), 13
[READ-FAILED], MaxLatency(us), 488
[READ-FAILED], 95thPercentileLatency(us), 24
[READ-FAILED], 99thPercentileLatency(us), 30
/usr/bin/java  -classpath /root/asterinas/YCSB/conf:/root/asterinas/YCSB/core/target/core-0.18.0-SNAPSHOT.jar:/root/asterinas/YCSB/core/target/dependency/HdrHistogram-2.1.12.jar:/root/asterinas/YCSB/core/target/dependency/htrace-core4-4.1.0-incubating.jar:/root/asterinas/YCSB/core/target/dependency/jackson-core-asl-1.9.4.jar:/root/asterinas/YCSB/core/target/dependency/jackson-mapper-asl-1.9.4.jar:/root/asterinas/YCSB/redis/target/redis-binding-0.18.0-SNAPSHOT.jar:/root/asterinas/YCSB/redis/target/dependency/commons-pool2-2.4.2.jar:/root/asterinas/YCSB/redis/target/dependency/jedis-2.9.0.jar site.ycsb.Client -t -db site.ycsb.db.RedisClient -P ./ycsb-0.17.0/workloads/workload-custom -p redis.host=10.0.2.15
[OVERALL], RunTime(ms), 3032
[OVERALL], Throughput(ops/sec), 32981.530343007915
[TOTAL_GCS_G1_Young_Generation], Count, 0
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.0
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 0
[TOTAL_GC_TIME], Time(ms), 0
[TOTAL_GC_TIME_%], Time(%), 0.0
[READ], Operations, 71
[READ], AverageLatency(us), 80.73239436619718
[READ], MinLatency(us), 22
[READ], MaxLatency(us), 2685
[READ], 95thPercentileLatency(us), 83
[READ], 99thPercentileLatency(us), 2685
[READ], Return=OK, 71
[READ], Return=ERROR, 4893
[DELETE], Operations, 2616
[DELETE], AverageLatency(us), 30.1414373088685
[DELETE], MinLatency(us), 13
[DELETE], MaxLatency(us), 378
[DELETE], 95thPercentileLatency(us), 46
[DELETE], 99thPercentileLatency(us), 53
[DELETE], Return=OK, 2616
[DELETE], Return=ERROR, 92420
[DELETE-FAILED], Operations, 92420
[DELETE-FAILED], AverageLatency(us), 29.815050854793334
[DELETE-FAILED], MinLatency(us), 26
[DELETE-FAILED], MaxLatency(us), 1635
[DELETE-FAILED], 95thPercentileLatency(us), 41
[DELETE-FAILED], 99thPercentileLatency(us), 46
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 344.0
[CLEANUP], MinLatency(us), 344
[CLEANUP], MaxLatency(us), 344
[CLEANUP], 95thPercentileLatency(us), 344
[CLEANUP], 99thPercentileLatency(us), 344
[READ-FAILED], Operations, 4893
[READ-FAILED], AverageLatency(us), 15.433272021254854
[READ-FAILED], MinLatency(us), 13
[READ-FAILED], MaxLatency(us), 999
[READ-FAILED], 95thPercentileLatency(us), 22
[READ-FAILED], 99thPercentileLatency(us), 28
/usr/bin/java  -classpath /root/asterinas/YCSB/conf:/root/asterinas/YCSB/core/target/core-0.18.0-SNAPSHOT.jar:/root/asterinas/YCSB/core/target/dependency/HdrHistogram-2.1.12.jar:/root/asterinas/YCSB/core/target/dependency/htrace-core4-4.1.0-incubating.jar:/root/asterinas/YCSB/core/target/dependency/jackson-core-asl-1.9.4.jar:/root/asterinas/YCSB/core/target/dependency/jackson-mapper-asl-1.9.4.jar:/root/asterinas/YCSB/redis/target/redis-binding-0.18.0-SNAPSHOT.jar:/root/asterinas/YCSB/redis/target/dependency/commons-pool2-2.4.2.jar:/root/asterinas/YCSB/redis/target/dependency/jedis-2.9.0.jar site.ycsb.Client -t -db site.ycsb.db.RedisClient -P ./ycsb-0.17.0/workloads/workload-custom -p redis.host=10.0.2.15
[OVERALL], RunTime(ms), 3009
[OVERALL], Throughput(ops/sec), 33233.632436025255
[TOTAL_GCS_G1_Young_Generation], Count, 0
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.0
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 0
[TOTAL_GC_TIME], Time(ms), 0
[TOTAL_GC_TIME_%], Time(%), 0.0
[READ], Operations, 73
[READ], AverageLatency(us), 85.84931506849315
[READ], MinLatency(us), 31
[READ], MaxLatency(us), 2719
[READ], 95thPercentileLatency(us), 67
[READ], 99thPercentileLatency(us), 2719
[READ], Return=OK, 73
[READ], Return=ERROR, 4876
[DELETE], Operations, 2488
[DELETE], AverageLatency(us), 34.42363344051447
[DELETE], MinLatency(us), 14
[DELETE], MaxLatency(us), 2463
[DELETE], 95thPercentileLatency(us), 49
[DELETE], 99thPercentileLatency(us), 60
[DELETE], Return=OK, 2488
[DELETE], Return=ERROR, 92563
[DELETE-FAILED], Operations, 92563
[DELETE-FAILED], AverageLatency(us), 29.524669684431146
[DELETE-FAILED], MinLatency(us), 26
[DELETE-FAILED], MaxLatency(us), 1694
[DELETE-FAILED], 95thPercentileLatency(us), 40
[DELETE-FAILED], 99thPercentileLatency(us), 45
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 355.0
[CLEANUP], MinLatency(us), 355
[CLEANUP], MaxLatency(us), 355
[CLEANUP], 95thPercentileLatency(us), 355
[CLEANUP], 99thPercentileLatency(us), 355
[READ-FAILED], Operations, 4876
[READ-FAILED], AverageLatency(us), 14.941345365053323
[READ-FAILED], MinLatency(us), 13
[READ-FAILED], MaxLatency(us), 224
[READ-FAILED], 95thPercentileLatency(us), 21
[READ-FAILED], 99thPercentileLatency(us), 28
/usr/bin/java  -classpath /root/asterinas/YCSB/conf:/root/asterinas/YCSB/core/target/core-0.18.0-SNAPSHOT.jar:/root/asterinas/YCSB/core/target/dependency/HdrHistogram-2.1.12.jar:/root/asterinas/YCSB/core/target/dependency/htrace-core4-4.1.0-incubating.jar:/root/asterinas/YCSB/core/target/dependency/jackson-core-asl-1.9.4.jar:/root/asterinas/YCSB/core/target/dependency/jackson-mapper-asl-1.9.4.jar:/root/asterinas/YCSB/redis/target/redis-binding-0.18.0-SNAPSHOT.jar:/root/asterinas/YCSB/redis/target/dependency/commons-pool2-2.4.2.jar:/root/asterinas/YCSB/redis/target/dependency/jedis-2.9.0.jar site.ycsb.Client -t -db site.ycsb.db.RedisClient -P ./ycsb-0.17.0/workloads/workload-custom -p redis.host=10.0.2.15
[OVERALL], RunTime(ms), 3822
[OVERALL], Throughput(ops/sec), 26164.311878597593
[TOTAL_GCS_G1_Young_Generation], Count, 0
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.0
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 0
[TOTAL_GC_TIME], Time(ms), 0
[TOTAL_GC_TIME_%], Time(%), 0.0
[READ], Operations, 83
[READ], AverageLatency(us), 49.566265060240966
[READ], MinLatency(us), 31
[READ], MaxLatency(us), 129
[READ], 95thPercentileLatency(us), 67
[READ], 99thPercentileLatency(us), 129
[READ], Return=OK, 83
[READ], Return=ERROR, 4892
[DELETE], Operations, 2360
[DELETE], AverageLatency(us), 34.722457627118644
[DELETE], MinLatency(us), 13
[DELETE], MaxLatency(us), 429
[DELETE], 95thPercentileLatency(us), 48
[DELETE], 99thPercentileLatency(us), 73
[DELETE], Return=OK, 2360
[DELETE], Return=ERROR, 92665
[DELETE-FAILED], Operations, 92665
[DELETE-FAILED], AverageLatency(us), 37.76860734905304
[DELETE-FAILED], MinLatency(us), 26
[DELETE-FAILED], MaxLatency(us), 2525
[DELETE-FAILED], 95thPercentileLatency(us), 45
[DELETE-FAILED], 99thPercentileLatency(us), 54
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 363.0
[CLEANUP], MinLatency(us), 363
[CLEANUP], MaxLatency(us), 363
[CLEANUP], 95thPercentileLatency(us), 363
[CLEANUP], 99thPercentileLatency(us), 363
[READ-FAILED], Operations, 4892
[READ-FAILED], AverageLatency(us), 20.063777596075226
[READ-FAILED], MinLatency(us), 13
[READ-FAILED], MaxLatency(us), 2525
[READ-FAILED], 95thPercentileLatency(us), 25
[READ-FAILED], 99thPercentileLatency(us), 32
/usr/bin/java  -classpath /root/asterinas/YCSB/conf:/root/asterinas/YCSB/core/target/core-0.18.0-SNAPSHOT.jar:/root/asterinas/YCSB/core/target/dependency/HdrHistogram-2.1.12.jar:/root/asterinas/YCSB/core/target/dependency/htrace-core4-4.1.0-incubating.jar:/root/asterinas/YCSB/core/target/dependency/jackson-core-asl-1.9.4.jar:/root/asterinas/YCSB/core/target/dependency/jackson-mapper-asl-1.9.4.jar:/root/asterinas/YCSB/redis/target/redis-binding-0.18.0-SNAPSHOT.jar:/root/asterinas/YCSB/redis/target/dependency/commons-pool2-2.4.2.jar:/root/asterinas/YCSB/redis/target/dependency/jedis-2.9.0.jar site.ycsb.Client -t -db site.ycsb.db.RedisClient -P ./ycsb-0.17.0/workloads/workload-custom -p redis.host=10.0.2.15
[OVERALL], RunTime(ms), 3350
[OVERALL], Throughput(ops/sec), 29850.746268656716
[TOTAL_GCS_G1_Young_Generation], Count, 0
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.0
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 0
[TOTAL_GC_TIME], Time(ms), 0
[TOTAL_GC_TIME_%], Time(%), 0.0
[READ], Operations, 68
[READ], AverageLatency(us), 60.98529411764706
[READ], MinLatency(us), 22
[READ], MaxLatency(us), 1429
[READ], 95thPercentileLatency(us), 66
[READ], 99thPercentileLatency(us), 1429
[READ], Return=OK, 68
[READ], Return=ERROR, 4994
[DELETE], Operations, 2232
[DELETE], AverageLatency(us), 27.475358422939067
[DELETE], MinLatency(us), 13
[DELETE], MaxLatency(us), 2061
[DELETE], 95thPercentileLatency(us), 44
[DELETE], 99thPercentileLatency(us), 53
[DELETE], Return=OK, 2232
[DELETE], Return=ERROR, 92706
[DELETE-FAILED], Operations, 92706
[DELETE-FAILED], AverageLatency(us), 33.25270209047958
[DELETE-FAILED], MinLatency(us), 26
[DELETE-FAILED], MaxLatency(us), 1506
[DELETE-FAILED], 95thPercentileLatency(us), 43
[DELETE-FAILED], 99thPercentileLatency(us), 51
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 355.0
[CLEANUP], MinLatency(us), 355
[CLEANUP], MaxLatency(us), 355
[CLEANUP], 95thPercentileLatency(us), 355
[CLEANUP], 99thPercentileLatency(us), 355
[READ-FAILED], Operations, 4994
[READ-FAILED], AverageLatency(us), 17.0905086103324
[READ-FAILED], MinLatency(us), 13
[READ-FAILED], MaxLatency(us), 333
[READ-FAILED], 95thPercentileLatency(us), 23
[READ-FAILED], 99thPercentileLatency(us), 29
/usr/bin/java  -classpath /root/asterinas/YCSB/conf:/root/asterinas/YCSB/core/target/core-0.18.0-SNAPSHOT.jar:/root/asterinas/YCSB/core/target/dependency/HdrHistogram-2.1.12.jar:/root/asterinas/YCSB/core/target/dependency/htrace-core4-4.1.0-incubating.jar:/root/asterinas/YCSB/core/target/dependency/jackson-core-asl-1.9.4.jar:/root/asterinas/YCSB/core/target/dependency/jackson-mapper-asl-1.9.4.jar:/root/asterinas/YCSB/redis/target/redis-binding-0.18.0-SNAPSHOT.jar:/root/asterinas/YCSB/redis/target/dependency/commons-pool2-2.4.2.jar:/root/asterinas/YCSB/redis/target/dependency/jedis-2.9.0.jar site.ycsb.Client -t -db site.ycsb.db.RedisClient -P ./ycsb-0.17.0/workloads/workload-custom -p redis.host=10.0.2.15
[OVERALL], RunTime(ms), 3023
[OVERALL], Throughput(ops/sec), 33079.72213033411
[TOTAL_GCS_G1_Young_Generation], Count, 0
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.0
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 0
[TOTAL_GC_TIME], Time(ms), 0
[TOTAL_GC_TIME_%], Time(%), 0.0
[READ], Operations, 51
[READ], AverageLatency(us), 66.07843137254902
[READ], MinLatency(us), 18
[READ], MaxLatency(us), 1624
[READ], 95thPercentileLatency(us), 57
[READ], 99thPercentileLatency(us), 1624
[READ], Return=OK, 51
[READ], Return=ERROR, 4977
[DELETE], Operations, 2104
[DELETE], AverageLatency(us), 26.73574144486692
[DELETE], MinLatency(us), 13
[DELETE], MaxLatency(us), 2339
[DELETE], 95thPercentileLatency(us), 44
[DELETE], 99thPercentileLatency(us), 62
[DELETE], Return=OK, 2104
[DELETE], Return=ERROR, 92868
[DELETE-FAILED], Operations, 92868
[DELETE-FAILED], AverageLatency(us), 29.93419692466727
[DELETE-FAILED], MinLatency(us), 26
[DELETE-FAILED], MaxLatency(us), 550
[DELETE-FAILED], 95thPercentileLatency(us), 42
[DELETE-FAILED], 99thPercentileLatency(us), 45
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 333.0
[CLEANUP], MinLatency(us), 333
[CLEANUP], MaxLatency(us), 333
[CLEANUP], 95thPercentileLatency(us), 333
[CLEANUP], 99thPercentileLatency(us), 333
[READ-FAILED], Operations, 4977
[READ-FAILED], AverageLatency(us), 15.188466947960618
[READ-FAILED], MinLatency(us), 13
[READ-FAILED], MaxLatency(us), 279
[READ-FAILED], 95thPercentileLatency(us), 21
[READ-FAILED], 99thPercentileLatency(us), 26
/usr/bin/java  -classpath /root/asterinas/YCSB/conf:/root/asterinas/YCSB/core/target/core-0.18.0-SNAPSHOT.jar:/root/asterinas/YCSB/core/target/dependency/HdrHistogram-2.1.12.jar:/root/asterinas/YCSB/core/target/dependency/htrace-core4-4.1.0-incubating.jar:/root/asterinas/YCSB/core/target/dependency/jackson-core-asl-1.9.4.jar:/root/asterinas/YCSB/core/target/dependency/jackson-mapper-asl-1.9.4.jar:/root/asterinas/YCSB/redis/target/redis-binding-0.18.0-SNAPSHOT.jar:/root/asterinas/YCSB/redis/target/dependency/commons-pool2-2.4.2.jar:/root/asterinas/YCSB/redis/target/dependency/jedis-2.9.0.jar site.ycsb.Client -t -db site.ycsb.db.RedisClient -P ./ycsb-0.17.0/workloads/workload-custom -p redis.host=10.0.2.15
[OVERALL], RunTime(ms), 3202
[OVERALL], Throughput(ops/sec), 31230.48094940662
[TOTAL_GCS_G1_Young_Generation], Count, 0
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.0
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 0
[TOTAL_GC_TIME], Time(ms), 0
[TOTAL_GC_TIME_%], Time(%), 0.0
[READ], Operations, 54
[READ], AverageLatency(us), 70.77777777777777
[READ], MinLatency(us), 21
[READ], MaxLatency(us), 1466
[READ], 95thPercentileLatency(us), 65
[READ], 99thPercentileLatency(us), 1466
[READ], Return=OK, 54
[READ], Return=ERROR, 5007
[DELETE], Operations, 1976
[DELETE], AverageLatency(us), 32.774797570850204
[DELETE], MinLatency(us), 14
[DELETE], MaxLatency(us), 2079
[DELETE], 95thPercentileLatency(us), 45
[DELETE], 99thPercentileLatency(us), 54
[DELETE], Return=OK, 1976
[DELETE], Return=ERROR, 92963
[DELETE-FAILED], Operations, 92963
[DELETE-FAILED], AverageLatency(us), 31.542570700171037
[DELETE-FAILED], MinLatency(us), 25
[DELETE-FAILED], MaxLatency(us), 1659
[DELETE-FAILED], 95thPercentileLatency(us), 42
[DELETE-FAILED], 99thPercentileLatency(us), 45
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 354.0
[CLEANUP], MinLatency(us), 354
[CLEANUP], MaxLatency(us), 354
[CLEANUP], 95thPercentileLatency(us), 354
[CLEANUP], 99thPercentileLatency(us), 354
[READ-FAILED], Operations, 5007
[READ-FAILED], AverageLatency(us), 16.078290393449173
[READ-FAILED], MinLatency(us), 13
[READ-FAILED], MaxLatency(us), 412
[READ-FAILED], 95thPercentileLatency(us), 24
[READ-FAILED], 99thPercentileLatency(us), 28